#include "Kana.h"

#include <utils/StringU8.h>

#include <algorithm>
#include <array>
#include <map>
#include <string>

namespace dictionary {

auto Kana::isKana(const std::string& token) -> bool
{
    return isHirigana(token) || isKatakana(token);
}

auto Kana::isHirigana(const std::string& token) -> bool
{
    static const std::array<std::string, 73> hirigana = {
            "あ", "い", "う", "え", "お",
            "か", "き", "く", "け", "こ",
            "さ", "し", "す", "せ", "そ",
            "た", "ち", "つ", "て", "と",
            "な", "に", "ぬ", "ね", "の",
            "は", "ひ", "ふ", "へ", "ほ",
            "ま", "み", "む", "め", "も",
            "や", "ゆ", "よ",
            "ら", "り", "る", "れ", "ろ",
            "わ", "を",
            "ん",
            "が", "ぎ", "ぐ", "げ", "ご",
            "ざ", "じ", "ず", "ぜ", "ぞ",
            "だ", "ぢ", "づ", "で", "ど",
            "ば", "び", "ぶ", "べ", "ぼ",
            "ぱ", "ぴ", "ぷ", "ぺ", "ぽ",
            "ょ", "ゅ"};

    const auto& strU8 = utl::StringU8(token);
    return std::ranges::all_of(strU8.getChars(),
                               [](const utl::CharU8& charU8) -> bool {
                                   return std::ranges::contains(hirigana, charU8.string());
                               });
}

auto Kana::isKatakana(const std::string& token) -> bool
{
    static const std::array<std::string, 73> katakana = {
            "ア", "イ", "ウ", "エ", "オ",
            "カ", "キ", "ク", "ケ", "コ",
            "サ", "シ", "ス", "セ", "ソ",
            "タ", "チ", "ツ", "テ", "ト",
            "ナ", "ニ", "ヌ", "ネ", "ノ",
            "ハ", "ヒ", "フ", "ヘ", "ホ",
            "マ", "ミ", "ム", "メ", "モ",
            "ヤ", "ユ", "ヨ",
            "ラ", "リ", "ル", "レ", "ロ",
            "ワ", "ヲ",
            "ン",
            "ガ", "ギ", "グ", "ゲ", "ゴ",
            "ザ", "ジ", "ズ", "ゼ", "ゾ",
            "ダ", "ヂ", "ヅ", "デ", "ド",
            "バ", "ビ", "ブ", "ベ", "ボ",
            "パ", "ピ", "プ", "ペ", "ポ",
            "ョ", "ュ"};
    const auto& strU8 = utl::StringU8(token);
    return std::ranges::all_of(strU8.getChars(),
                               [](const utl::CharU8& charU8) -> bool {
                                   return std::ranges::contains(katakana, charU8.string());
                               });
}

auto katakanaToHirigana(const std::string& katakana) -> std::string
{ // clang-format off
    static std::map<std::string, std::string> kToH = {
      {"ア","あ"},    {"イ","い"},      {"ウ","う"},      {"エ","え"},  {"オ","お"},
      {"カ","か"},    {"キ","き"},      {"ク","く"},      {"ケ","け"},  {"コ","こ"},
      {"サ","さ"},    {"シ","し"},      {"ス","す"},      {"セ","せ"},  {"ソ","そ"},
      {"タ","た"},    {"チ","ち"},      {"ツ","つ"},      {"テ","て"},  {"ト","と"},
      {"ナ","な"},    {"ニ","に"},      {"ヌ","ぬ"},      {"ネ","ね"},  {"ノ","の"},
      {"ハ","は"},    {"ヒ","ひ"},      {"フ","ふ"},      {"ヘ","へ"},  {"ホ","ほ"},
      {"マ","ま"},    {"ミ","み"},      {"ム","む"},      {"メ","め"},  {"モ","も"},
      {"ヤ","や"},                      {"ユ","ゆ"},                    {"ヨ","よ"},
      {"ラ","ら"},    {"リ","り"},      {"ル","る"},      {"レ","れ"},  {"ロ","ろ"},
      {"ワ","わ"},                                                      {"ヲ","を"},
      {"ン","ん"},
      {"ガ","が"},    {"ギ","ぎ"},      {"グ","ぐ"},      {"ゲ","げ"},  {"ゴ","ご"},
      {"ザ","ざ"},    {"ジ","じ"},      {"ズ","ず"},      {"ゼ","ぜ"},  {"ゾ","ぞ"},
      {"ダ","だ"},    {"ヂ","ぢ"},      {"ヅ","づ"},      {"デ","で"},  {"ド","ど"},
      {"バ","ば"},    {"ビ","び"},      {"ブ","ぶ"},      {"ベ","べ"},  {"ボ","ぼ"},
      {"パ","ぱ"},    {"ピ","ぴ"},      {"プ","ぷ"},      {"ペ","ぺ"},  {"ポ","ぽ"},
      {"キョ","きょ"},                  {"キュ","きゅ"},                {"キョ","きょ"},
      {"ショ","しょ"},                  {"シュ","しゅ"},                {"ショ","しょ"},
      {"チョ","ちょ"},                  {"チュ","ちゅ"},                {"チョ","ちょ"},
      {"ニョ","にょ"},                  {"ニュ","にゅ"},                {"ニョ","にょ"},
      {"ヒョ","ひょ"},                  {"ヒュ","ひゅ"},                {"ヒョ","ひょ"},
      {"ミョ","みょ"},                  {"ミュ","みゅ"},                {"ミョ","みょ"},
      {"リョ","りょ"},                  {"リュ","りゅ"},                {"リョ","りょ"},
      {"ギョ","ぎょ"},                  {"ギュ","ぎゅ"},                {"ギョ","ぎょ"},
      {"ジョ","じょ"},                  {"ジュ","じゅ"},                {"ジョ","じょ"},
      {"ビョ","びょ"},                  {"ビュ","びゅ"},                {"ビョ","びょ"},
      {"ピョ","ぴょ"},                  {"ピュ","ぴゅ"},                {"ピョ","ぴょ"},
    }; // clang-format on
    return kToH.at(katakana);
}

auto hiriganaToKatakana(const std::string& hirigana) -> std::string
{ // clang-format off
    static std::map<std::string, std::string> hToK = {
      {"あ","ア"},    {"い","イ"},      {"う","ウ"},      {"え","エ"},  {"お","オ"},
      {"か","カ"},    {"き","キ"},      {"く","ク"},      {"け","ケ"},  {"こ","コ"},
      {"さ","サ"},    {"し","シ"},      {"す","ス"},      {"せ","セ"},  {"そ","ソ"},
      {"た","タ"},    {"ち","チ"},      {"つ","ツ"},      {"て","テ"},  {"と","ト"},
      {"な","ナ"},    {"に","ニ"},      {"ぬ","ヌ"},      {"ね","ネ"},  {"の","ノ"},
      {"は","ハ"},    {"ひ","ヒ"},      {"ふ","フ"},      {"へ","ヘ"},  {"ほ","ホ"},
      {"ま","マ"},    {"み","ミ"},      {"む","ム"},      {"め","メ"},  {"も","モ"},
      {"や","ヤ"},                      {"ゆ","ユ"},                    {"よ","ヨ"},
      {"ら","ラ"},    {"り","リ"},      {"る","ル"},      {"れ","レ"},  {"ろ","ロ"},
      {"わ","ワ"},                                                      {"を","ヲ"},
      {"ん","ン"},
      {"が","ガ"},    {"ぎ","ギ"},       {"ぐ","グ"},      {"げ","ゲ"}, {"ご","ゴ"},
      {"ざ","ザ"},    {"じ","ジ"},       {"ず","ズ"},      {"ぜ","ゼ"}, {"ぞ","ゾ"},
      {"だ","ダ"},    {"ぢ","ヂ"},       {"づ","ヅ"},      {"で","デ"}, {"ど","ド"},
      {"ば","バ"},    {"び","ビ"},       {"ぶ","ブ"},      {"べ","ベ"}, {"ぼ","ボ"},
      {"ぱ","パ"},    {"ぴ","ピ"},       {"ぷ","プ"},      {"ぺ","ペ"}, {"ぽ","ポ"},
      {"きゃ","キャ"},                   {"きゅ","キュ"},               {"きょ","キョ"},
      {"しゃ","シャ"},                   {"しゅ","シュ"},               {"しょ","ショ"},
      {"ちゃ","チャ"},                   {"ちゅ","チュ"},               {"ちょ","チョ"},
      {"にゃ","ニャ"},                   {"にゅ","ニュ"},               {"にょ","ニョ"},
      {"ひゃ","ヒャ"},                   {"ひゅ","ヒュ"},               {"ひょ","ヒョ"},
      {"みゃ","ミャ"},                   {"みゅ","ミュ"},               {"みょ","ミョ"},
      {"りゃ","リャ"},                   {"りゅ","リュ"},               {"りょ","リョ"},
      {"ぎゃ","ギャ"},                   {"ぎゅ","ギュ"},               {"ぎょ","ギョ"},
      {"じゃ","ジャ"},                   {"じゅ","ジュ"},               {"じょ","ジョ"},
      {"びゃ","ビャ"},                   {"びゅ","ビュ"},               {"びょ","ビョ"},
      {"ぴゃ","ピャ"},                   {"ぴゅ","ピュ"},               {"ぴょ","ピョ"},
    }; // clang-format on
    return hToK.at(hirigana);
}

auto katakanaToRomanji(const std::string& katakana) -> std::string
{ // clang-format off
    static std::map<std::string, std::string> kToR = {
      {"ア","a"},     {"イ","i"},       {"ウ","u"},       {"エ","e" }, {"オ","o"},
      {"カ","ka"},    {"キ","ki"},      {"ク","ku"},      {"ケ","ke"}, {"コ","ko"},
      {"サ","sa"},    {"シ","shi"},     {"ス","su"},      {"セ","se"}, {"ソ","so"},
      {"タ","ta"},    {"チ","chi"},     {"ツ","tsu"},     {"テ","te"}, {"ト","to"},
      {"ナ","na"},    {"ニ","ni"},      {"ヌ","nu"},      {"ネ","ne"}, {"ノ","no"},
      {"ハ","ha"},    {"ヒ","hi"},      {"フ","fu"},      {"ヘ","he"}, {"ホ","ho"},
      {"マ","ma"},    {"ミ","mi"},      {"ム","mu"},      {"メ","me"}, {"モ","mo"},
      {"ヤ","ya"},                      {"ユ","yu"},                   {"ヨ","yo"},
      {"ラ","ra"},    {"リ","ri"},      {"ル","ru"},      {"レ","re"}, {"ロ","ro"},
      {"ワ","wa"},                                                     {"ヲ","o (wo)"},
      {"ン","n" },
      {"ガ","ga"},    {"ギ","gi"},      {"グ","gu"},      {"ゲ","ge"}, {"ゴ","go"},
      {"ザ","za"},    {"ジ","ji (zi)"}, {"ズ","zu"},      {"ゼ","ze"}, {"ゾ","zo"},
      {"ダ","da"},    {"ヂ","ji (di)"}, {"ヅ","zu (du)"}, {"デ","de"}, {"ド","do"},
      {"バ","ba"},    {"ビ","bi"},      {"ブ","bu"},      {"ベ","be"}, {"ボ","bo"},
      {"パ","pa"},    {"ピ","pi"},      {"プ","pu"},      {"ペ","pe"}, {"ポ","po"},
      {"キャ","kya"},                   {"キュ","kyu"},                {"キョ","kyo"},
      {"シャ","sha"},                   {"シュ","shu"},                {"ショ","sho"},
      {"チャ","cha"},                   {"チュ","chu"},                {"チョ","cho"},
      {"ニャ","nya"},                   {"ニュ","nyu"},                {"ニョ","nyo"},
      {"ヒャ","hya"},                   {"ヒュ","hyu"},                {"ヒョ","hyo"},
      {"ミャ","mya"},                   {"ミュ","myu"},                {"ミョ","myo"},
      {"リャ","rya"},                   {"リュ","ryu"},                {"リョ","ryo"},
      {"ギャ","gya"},                   {"ギュ","gyu"},                {"ギョ","gyo"},
      {"ジャ","ja"},                    {"ジュ","ju"},                 {"ジョ","jo"},
      {"ビャ","bya"},                   {"ビュ","byu"},                {"ビョ","byo"},
      {"ピャ","pya"},                   {"ピュ","pyu"},                {"ピョ","pyo"},
    }; // clang-format on
    return kToR.at(katakana);
}

auto hiriganaToRomanji(const std::string& hirigana) -> std::string
{ // clang-format off
    static std::map<std::string, std::string> hToR = {
      {"あ","a"},     {"い","i"},       {"う","u"},       {"え","e"},  {"お","o"},
      {"か","ka"},    {"き","ki"},      {"く","ku"},      {"け","ka"}, {"こ","ko"},
      {"さ","sa"},    {"し","shi"},     {"す","su"},      {"せ","se"}, {"そ","so"},
      {"た","ta"},    {"ち","chi"},     {"つ","tsu"},     {"て","te"}, {"と","to"},
      {"な","na"},    {"に","ni"},      {"ぬ","nu"},      {"ね","ne"}, {"の","no"},
      {"は","ha"},    {"ひ","hi"},      {"ふ","fu"},      {"へ","he"}, {"ほ","ho"},
      {"ま","ma"},    {"み","mi"},      {"む","mu"},      {"め","me"}, {"も","mo"},
      {"や","ya"},                      {"ゆ","yu"},                   {"よ","yo"},
      {"ら","ra"},    {"り","ri"},      {"る","ru"},      {"れ","re"}, {"ろ","ro"},
      {"わ","wa"},                                                     {"を","o (wo)"},
      {"ん","n"},
      {"が","ga"},    {"ぎ","gi"},      {"ぐ","gu"},      {"げ","ge"}, {"ご","go"},
      {"ざ","za"},    {"じ","ji (zi)"}, {"ず","zu"},      {"ぜ","ze"}, {"ぞ","zo"},
      {"だ","da"},    {"ぢ","ji (di)"}, {"づ","zu (du)"}, {"で","de"}, {"ど","do"},
      {"ば","ba"},    {"び","bi"},      {"ぶ","bu"},      {"べ","be"}, {"ぼ","bo"},
      {"ぱ","pa"},    {"ぴ","pi"},      {"ぷ","pu"},      {"ぺ","pe"}, {"ぽ","po"},
      {"きゃ","kya"},                   {"きゅ","kyu"},                {"きょ","kyo"},
      {"しゃ","sha"},                   {"しゅ","shu"},                {"しょ","sho"},
      {"ちゃ","cha"},                   {"ちゅ","chu"},                {"ちょ","cho"},
      {"にゃ","nya"},                   {"にゅ","nyu"},                {"にょ","nyo"},
      {"ひゃ","hya"},                   {"ひゅ","hyu"},                {"ひょ","hyo"},
      {"みゃ","mya"},                   {"みゅ","myu"},                {"みょ","myo"},
      {"りゃ","rya"},                   {"りゅ","ryu"},                {"りょ","ryo"},
      {"ぎゃ","gya"},                   {"ぎゅ","gyu"},                {"ぎょ","gyo"},
      {"じゃ","ja"},                    {"じゅ","ju"},                 {"じょ","jo"},
      {"びゃ","bya"},                   {"びゅ","byu"},                {"びょ","byo"},
      {"ぴゃ","pya"},                   {"ぴゅ","pyu"},                {"ぴょ","pyo"},
    }; // clang-format on
    return hToR.at(hirigana);
}
} // namespace dictionary
