#include "Mecab.h"

#include "MecabWrapper.h"

#include <memory>
#include <string>
#include <vector>

namespace annotation {

Mecab::Mecab()
    : mecabWrapper{std::make_shared<MecabWrapper>()}
{}

auto Mecab::split(const std::string& text) -> std::vector<MecabToken>
{
    return mecabWrapper->split(text);
}

// Type and POS fields in unidic-cwj-202302
//
//  type,pos1,pos2,pos3,pos4
//  人名,名詞,固有名詞,人名,一般
//  他,感動詞,フィラー,*,*
//  他,感動詞,一般,*,*
//  他,接続詞,*,*,*
//  体,代名詞,*,*,*
//  体,名詞,助動詞語幹,*,*
//  体,名詞,普通名詞,サ変可能,*
//  体,名詞,普通名詞,サ変形状詞可能,*
//  体,名詞,普通名詞,一般,*
//  体,名詞,普通名詞,副詞可能,*
//  体,名詞,普通名詞,助数詞可能,*
//  体,名詞,普通名詞,形状詞可能,*
//  係助,助詞,係助詞,*,*
//  副助,助詞,副助詞,*,*
//  助動,助動詞,*,*,*
//  助動,形状詞,助動詞語幹,*,*
//  助数,接尾辞,名詞的,助数詞,*
//  名,名詞,固有名詞,人名,名
//  固有名,名詞,固有名詞,一般,*
//  国,名詞,固有名詞,地名,国
//  地名,名詞,固有名詞,地名,一般
//  姓,名詞,固有名詞,人名,姓
//  接助,助詞,接続助詞,*,*
//  接尾体,接尾辞,名詞的,サ変可能,*
//  接尾体,接尾辞,名詞的,一般,*
//  接尾体,接尾辞,名詞的,副詞可能,*
//  接尾用,接尾辞,動詞的,*,*
//  接尾相,接尾辞,形容詞的,*,*
//  接尾相,接尾辞,形状詞的,*,*
//  接頭,接頭辞,*,*,*
//  数,名詞,数詞,*,*
//  格助,助詞,格助詞,*,*
//  準助,助詞,準体助詞,*,*
//  用,動詞,一般,*,*
//  用,動詞,非自立可能,*,*
//  相,副詞,*,*,*
//  相,形容詞,一般,*,*
//  相,形容詞,非自立可能,*,*
//  相,形状詞,タリ,*,*
//  相,形状詞,一般,*,*
//  相,連体詞,*,*,*
//  終助,助詞,終助詞,*,*
//  補助,空白,*,*,*
//  補助,補助記号,一般,*,*
//  補助,補助記号,句点,*,*
//  補助,補助記号,括弧閉,*,*
//  補助,補助記号,括弧開,*,*
//  補助,補助記号,読点,*,*
//  補助,補助記号,ＡＡ,一般,*
//  補助,補助記号,ＡＡ,顔文字,*
//  記号,記号,一般,*,*
//  記号,記号,文字,*,*
//      </pre>
//  </details>
} // namespace annotation
